#приветствие и начальный выбор
def main():
    while True:
        print("""
┌──────────────────────────────────────────────────┐
│              RAID CALCULATOR IN RUST             │
└──────────────────────────────────────────────────┘
""")
        print('Добро пожаловать в калькулятор рейда в раст')
        print('Выберите что хотите разрушить:')
        print("""
┌────────────────────────────────────┐
│  1. Двери                          │
│  2. Стены                          │
│  3. Окна                           │
│  4. Другое                         │
└────────────────────────────────────┘
 [ Выберите категорию и введите номер или 'Q' - Выход ]
""")
        choice = input().strip()

        if choice == '1':
            doors()
        elif choice == '2':
            walls()
        elif choice == '3':
            windows()
        elif choice == '4':
            other()
        elif choice.lower() == 'q':
            print('Выход из программы...')
            break
        else:
            print('Введите корректное чисо!')
            continue

#пользователь выбрал 'двери'
def doors():
    while True:
        print("""
 ██████╗  ██████╗  ██████╗ ██████╗ ███████╗
 ██╔══██╗██╔═══██╗██╔═══██╗██╔══██╗██╔════╝
 ██║  ██║██║   ██║██║   ██║██████╔╝███████╗
 ██║  ██║██║   ██║██║   ██║██╔══██╗╚════██║
 ██████╔╝╚██████╔╝╚██████╔╝██║  ██║███████║
 ╚═════╝  ╚═════╝  ╚═════╝ ╚═╝  ╚═╝╚══════╝
""")
        print('Выбери дверь:')
        print("""
┌────────────────────────────────────┐
│  1. Деревянная дверь               │
│  2. Металлическая дверь            │
│  3. МВК дверь                      │
│  4. Люк                            │
│  5. Гаражная дверь                 │
└────────────────────────────────────┘
 [ Выберите номер или 'Q' - Выход ]
""")
        choice = input().strip()

        if choice == '1':
            print("Стоимость рейда 'Деревянная дверь': ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 6x ]  │  [ 720x ] Серы   │  [ 360x ] пороха │
│ 2. Сачель               │  [ 2x ]  │  [ 960x ] Серы   │  [ 480x ] пороха │
│ 3. C4                   │  [ 1x ]  │  [ 2200x ] Серы  │  [ 1000x ] пороха│
│ 4. Ракета               │  [ 1x ]  │  [ 1400x ] Серы  │  [ 650x ] пороха │
│ 5. Разрывной патрон     │  [ 18x ] │  [ 360x ] Серы   │  [ 180x ] пороха │
│ 6. Зажиг. 12 калибр     │  [ 16x ] │  [ 160x ] Серы   │  [ 80x ] пороха  │
│ 7. Коктейль Молотова    │  [ 3x ]  │  [ 150x ] ТНК    │  [ 30x ] ткани   │
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '2':
            print("Стоимость рейда 'Металлическая дверь': ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 18x ] │  [ 2160x ] Серы  │  [ 1080x ] пороха│
│ 2. Сачель               │  [ 4x ]  │  [ 1920x ] Серы  │  [ 960x ] пороха │
│ 3. C4                   │  [ 1x ]  │  [ 2200x ] Серы  │  [ 1000x ] пороха│
│ 4. Ракета               │  [ 2x ]  │  [ 2800x ] Серы  │  [ 1300x ] пороха│
│ 5. Разрывной патрон     │  [ 63x ] │  [ 1890x ] Серы  │  [ 630x ] пороха │
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '3':
            print("Стоимость рейда 'МВК дверь': ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 69x ] │  [ 8280x ] Серы  │  [ 4140x ] пороха│
│ 2. Сачель               │  [ 15x ] │  [ 7200x ] Серы  │  [ 3600x ] пороха│
│ 3. C4                   │  [ 3x ]  │  [ 6600x ] Серы  │  [ 3000x ] пороха│
│ 4. Ракета               │  [ 5x ]  │  [ 7000x ] Серы  │  [ 3250x ] пороха│
│ 5. Разрывной патрон     │  [ 250x ]│  [ 6250x ] Серы  │  [ 2500x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '4':
            print("Стоимость рейда 'Люк': ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 18x ] │  [ 2160x ] Серы  │  [ 1080x ] пороха│
│ 2. Сачель               │  [ 4x ]  │  [ 1920x ] Серы  │  [ 960x ]  пороха│
│ 3. C4                   │  [ 1x ]  │  [ 2200x ] Серы  │  [ 1000x ] пороха│
│ 4. Ракета               │  [ 2x ]  │  [ 2800x ] Серы  │  [ 1300x ] пороха│
│ 5. Разрывной патрон     │  [ 63x ] │  [ 1600x ] Серы  │  [ 960x ]  пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '5':
            print("Стоимость рейда 'Гаражная дверь': ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 42x ] │  [ 5040x ] Серы  │  [ 2520x ] пороха│
│ 2. Сачель               │  [ 9x ]  │  [ 4320x ] Серы  │  [ 2160x ] пороха│
│ 3. C4                   │  [ 2x ]  │  [ 4400x ] Серы  │  [ 2000x ] пороха│
│ 4. Ракета               │  [ 3x ]  │  [ 4200x ] Серы  │  [ 1950x ] пороха│
│ 5. Разрывной патрон     │  [ 150x ]│  [ 3750x ] Серы  │  [ 1500x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice.lower() == 'q':
            print('Выход из программы...')
            break
        else:
            print('Введите корректное чисо!')
            continue

 #пользователь выбрал 'стены'
def walls():
    while True:
        print("""
██╗    ██╗ █████╗ ██╗     ██╗     ███████╗
██║    ██║██╔══██╗██║     ██║     ██╔════╝
██║ █╗ ██║███████║██║     ██║     ███████╗
██║███╗██║██╔══██║██║     ██║     ╚════██║
╚███╔███╔╝██║  ██║███████╗███████╗███████║
 ╚══╝╚══╝ ╚═╝  ╚═╝╚══════╝╚══════╝╚══════╝
""")
        print('Выбери стену:')
        print("""
┌────────────────────────────────────┐
│  1. Деревянная стена               │
│  2. Каменная стена                 │
│  3. Железная стена                 │
│  4. МВК стена                      │
│  5. Высокая деревянная стена       │
│  6. Высокая каменная стена         │
└────────────────────────────────────┘
 [ Выберите номер или 'Q' - Назад ]
""")
        choice = input().strip()
        if choice == '1':     
            print("Стоимость рейда 'Деревянная стена: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 13x ] │  [ 1560x ] Серы  │  [ 780x ] пороха │
│ 2. Сачель               │  [ 3x ]  │  [ 1440x ] Серы  │  [ 720x ] пороха │
│ 3. C4                   │  [ 1x ]  │  [ 2200x ] Серы  │  [ 1000x ] пороха│
│ 4. Ракета               │  [ 2x ]  │  [ 2800x ] Серы  │  [ 1300x ] пороха│
│ 5. Разрывной патрон     │  [ 50x ] │  [ 1250x ] Серы  │  [ 500x ] пороха │
│ 6. Зажиг. 12 калибр     │  [ 39x ] │  [ 780x ] Серы   │  [ 195x ] пороха │
│ 7. Коктейль Молотова    │  [ 6x ]  │  [ 300x ] ТНК    │  [ 60x ] ткани   │
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '2':
            print("Стоимость рейда 'Каменная стена: ")  
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 46x ] │  [ 5520x ] Серы  │  [ 2760x ] пороха│
│ 2. Сачель               │  [ 10x ] │  [ 4080x ] Серы  │  [ 2400x ] пороха│
│ 3. C4                   │  [ 2x ]  │  [ 4400x ] Серы  │  [ 2000x ] пороха│
│ 4. Ракета               │  [ 4x ]  │  [ 5600x ] Серы  │  [ 2600x ] пороха│
│ 5. Разрывной патрон     │  [ 185x ]│  [ 4625x ] Серы  │  [ 1850x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '3':
            print("Стоимость рейда 'Железная стена: ")  
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 112x ]│  [ 13440x ] Серы │  [ 6720x ] пороха│
│ 2. Сачель               │  [ 23x ] │  [ 11040x ] Серы │  [ 5520x ] пороха│
│ 3. C4                   │  [ 4x ]  │  [ 8800x ] Серы  │  [ 4000x ] пороха│
│ 4. Ракета               │  [ 8x ]  │  [ 11200x ] Серы │  [ 5200x ] пороха│
│ 5. Разрывной патрон     │  [ 406x ]│  [ 10150x ] Серы │  [ 4060x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '4':
            print("Стоимость рейда 'МВК стена: ")  
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 223x ]│  [ 26760x ] Серы │  [ 13380x] пороха│
│ 2. Сачель               │  [ 46x ] │  [ 22080x ] Серы │  [ 11040x] пороха│
│ 3. C4                   │  [ 8x ]  │  [ 17600x ] Серы │  [ 4000x ] пороха│
│ 4. Ракета               │  [ 15x ] │  [ 21000x ] Серы │  [ 9750x ] пороха│
│ 5. Разрывной патрон     │  [ 800x ]│  [ 20000x ] Серы │  [ 8000x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '5':
            print("Стоимость рейда 'Высокая деревянная стена: ")  
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 26x ] │  [ 3120x ] Серы  │  [ 1560x ] пороха│
│ 2. Сачель               │  [ 6x ]  │  [ 2880x ] Серы  │  [ 1440x ] пороха│
│ 3. C4                   │  [ 2x ]  │  [ 4400x ] Серы  │  [ 2000x ] пороха│
│ 4. Ракета               │  [ 3x ]  │  [ 4200x ] Серы  │  [ 1950x ] пороха│
│ 5. Разрывной патрон     │  [ 97x ] │  [ 2425x ] Серы  │  [ 970x ] пороха │
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '6':
            print("Стоимость рейда 'Высокая каменная стена: ")  
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 46x ] │  [ 5520x ] Серы  │  [ 2760x ] пороха│
│ 2. Сачель               │  [ 10x ] │  [ 4080x ] Серы  │  [ 2400x ] пороха│
│ 3. C4                   │  [ 2x ]  │  [ 4400x ] Серы  │  [ 2000x ] пороха│
│ 4. Ракета               │  [ 4x ]  │  [ 5600x ] Серы  │  [ 2600x ] пороха│
│ 5. Разрывной патрон     │  [ 185x ]│  [ 4625x ] Серы  │  [ 1850x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice.lower() == 'q':
            print('Выход из программы...')
            break
        else:
            print('Введите корректное чисо!')
            continue
#пользователь выбрал 'окна'
def windows():
    while True:
        print("""
██╗    ██╗██╗███╗   ██╗██████╗  ██████╗ ██╗    ██╗███████╗
██║    ██║██║████╗  ██║██╔══██╗██╔═══██╗██║    ██║██╔════╝
██║ █╗ ██║██║██╔██╗ ██║██║  ██║██║   ██║██║ █╗ ██║███████╗
██║███╗██║██║██║╚██╗██║██║  ██║██║   ██║██║███╗██║╚════██║
╚███╔███╔╝██║██║ ╚████║██████╔╝╚██████╔╝╚███╔███╔╝███████║
 ╚══╝╚══╝ ╚═╝╚═╝  ╚═══╝╚═════╝  ╚═════╝  ╚══╝╚══╝ ╚══════╝
""")
        print('Выбери окно:')
        print("""
┌────────────────────────────────────┐
│  1. Деревянные решетки             │
│  2. Металлические решетки          │
│  3. Укреплённое стеклянное окно    │
│  4. Усиленное стеклянное окно      │
│  5. Бойница                        │
└────────────────────────────────────┘
 [ Выберите номер или 'Q' - Назад ]
""")
        choice = input().strip()
        if choice == '1':
            print("Стоимость рейда 'Деревянные решетки: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 13x ] │  [ 1560x ] Серы  │  [ 780x ] пороха │
│ 2. Сачель               │  [ 3x ]  │  [ 1440x ] Серы  │  [ 720x ] пороха │
│ 3. C4                   │  [ 1x ]  │  [ 2200x ] Серы  │  [ 1000x ] пороха│
│ 4. Ракета               │  [ 2x ]  │  [ 2800x ] Серы  │  [ 1300x ] пороха│
│ 5. Разрывной патрон     │  [ 42x ] │  [ 1050x ] Серы  │  [ 420x ] пороха │
│ 6. Зажиг. 12 калибр     │  [ 40x ] │  [ 800x ] Серы   │  [ 200x ] пороха │
│ 7. Коктейль Молотова    │  [ 4x ]  │  [ 200x ] ТНК    │  [ 40x ] ткани   │
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '2':
            print("Стоимость рейда 'Металлические решетки: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 56x ] │  [ 6720x ] Серы  │  [ 3360x ] пороха│
│ 2. Сачель               │  [ 12x ] │  [ 5760x ] Серы  │  [ 2880x ] пороха│
│ 3. C4                   │  [ 2x ]  │  [ 4400x ] Серы  │  [ 2000x ] пороха│
│ 4. Ракета               │  [ 4x ]  │  [ 5600x ] Серы  │  [ 2600x ] пороха│
│ 5. Разрывной патрон     │  [ 200x ]│  [ 5000 ] Серы   │  [ 2000x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '3':
            print("Стоимость рейда 'Укреплённое стеклянное окно: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 46x ] │  [ 5520x ] Серы  │  [ 2760x ] пороха│
│ 2. Сачель               │  [ 10x ] │  [ 4080x ] Серы  │  [ 2400x ] пороха│
│ 3. C4                   │  [ 2x ]  │  [ 4400x ] Серы  │  [ 2000x ] пороха│
│ 4. Ракета               │  [ 4x ]  │  [ 5600x ] Серы  │  [ 2600x ] пороха│
│ 5. Разрывной патрон     │  [ 185x ]│  [ 4625x ] Серы  │  [ 1850x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '4':
            print("Стоимость рейда 'Усиленное стеклянное окно: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 39x ] │  [ 4680x ] Серы  │  [ 2340x ] пороха│
│ 2. Сачель               │  [ 9x ]  │  [ 4320x ] Серы  │  [ 2160x ] пороха│
│ 3. C4                   │  [ 2x ]  │  [ 4400x ] Серы  │  [ 2000x ] пороха│
│ 4. Ракета               │  [ 3x ]  │  [ 4200x ] Серы  │  [ 1950x ] пороха│
│ 5. Разрывной патрон     │  [ 140x ]│  [ 3500x ] Серы  │  [ 1400x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '5':
            print("Стоимость рейда 'Бойница: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 59x ] │  [ 7080x ] Серы  │  [ 3540x ] пороха│
│ 2. Сачель               │  [ 13x ] │  [ 6240x ] Серы  │  [ 3120x ] пороха│
│ 3. C4                   │  [ 2x ]  │  [ 4400x ] Серы  │  [ 2000x ] пороха│
│ 4. Ракета               │  [ 4x ]  │  [ 5600x ] Серы  │  [ 2600x ] пороха│
│ 5. Разрывной патрон     │  [ 171x ]│  [ 4275x ] Серы  │  [ 1710x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice.lower() == 'q':
            print('Выход из программы...')
            break
        else:
            print('Введите корректное чисо!')
            continue
#пользователь выбрал 'другое'
def other():
    while True:
        print("""
 ██████╗ ████████╗██╗  ██╗███████╗██████╗ 
██╔═══██╗╚══██╔══╝██║  ██║██╔════╝██╔══██╗
██║   ██║   ██║   ███████║█████╗  ██████╔╝
██║   ██║   ██║   ██╔══██║██╔══╝  ██╔══██╗
╚██████╔╝   ██║   ██║  ██║███████╗██║  ██║
 ╚═════╝    ╚═╝   ╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝
""")
        print('Выбери предмет:')
        print("""                                           
┌────────────────────────────────────┐
│  1. Шкаф                           │
│  2. Деревянная баррикада           │
│  3. Железная баррикада             │
│  4. Автоматическая турель          │
│  5. Зенитная турель                │
│  6. Танк                           │
└────────────────────────────────────┘
 [ Выберите номер или 'Q' - Назад ]
""")
        choice = input().strip()
        if choice == '1':
            print("Стоимость рейда 'Шкаф: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 4x ]  │  [ 480x ]  Серы  │  [ 240x ] пороха │
│ 2. Сачель               │  [ 1x ]  │  [ 480x ]  Серы  │  [ 240x ] пороха │
│ 3. C4                   │  [ 1x ]  │  [ 2200x ] Серы  │  [ 1000x ] пороха│
│ 4. Ракета               │  [ 1x ]  │  [ 1400x ] Серы  │  [ 650x ]  пороха│
│ 5. Разрывной патрон     │  [ 9x ]  │  [ 225x ] Серы   │  [ 90x ]  пороха │
│ 6. Зажиг. 12 калибр     │  [ 4x ]  │  [ 80x ] Серы    │  [ 20x ]  пороха │
│ 7. Коктейль Молотова    │  [ 2x ]  │  [ 100x ] ТНК    │  [ 20x ] ткани   │
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '2':
            print("Стоимость рейда 'Деревянная баррикада: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 4x ]  │  [ 480x ]  Серы  │  [ 240x ] пороха │
│ 2. Сачель               │  [ 1x ]  │  [ 480x ]  Серы  │  [ 240x ] пороха │
│ 3. C4                   │  [ 1x ]  │  [ 2200x ] Серы  │  [ 1000x ] пороха│
│ 4. Ракета               │  [ 1x ]  │  [ 1400x ] Серы  │  [ 650x ]  пороха│
│ 5. Разрывной патрон     │  [ 20x ]  │  [ 500x ] Серы  │  [ 200x ]  пороха│
│ 6. Зажиг. 12 калибр     │  [ 3x ]  │  [ 60x ] Серы    │  [ 15x ]  пороха │
│ 7. Коктейль Молотова    │  [ 1x ]  │  [ 50x ] ТНК     │  [ 10x ] ткани   │
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '3':
            print("Стоимость рейда 'Железная баррикада: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Бобовая граната      │  [ 38x ] │  [ 4560x ] Серы  │  [ 2280x ] пороха│
│ 2. Сачель               │  [ 4x ]  │  [ 1920x ]  Серы │  [ 960x ]  пороха│
│ 3. C4                   │  [ 1x ]  │  [ 2200x ] Серы  │  [ 1000x ] пороха│
│ 4. Ракета               │  [ 3x ]  │  [ 4200x ] Серы  │  [ 1950x ] пороха│
│ 5. Разрывной патрон     │  [ 110x ]│  [ 2750x ] Серы  │  [ 1100x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '4':
            print("Стоимость рейда 'Автоматическая турель: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Сачель               │  [ 2x ]  │  [ 960x ]   Серы │  [ 480x ]  пороха│
│ 2. C4                   │  [ 1x ]  │  [ 2200x ] Серы  │  [ 1000x ] пороха│
│ 3. Ракета               │  [ 4x ]  │  [ 5600x ] Серы  │  [ 2600x ] пороха│
│ 4. Скоростная ракета    │  [ 3x ]  │  [ 600x ]  Серы  │  [ 300x ]  пороха│
│ 5. Разрывной патрон     │  [ 110x ]│  [ 2750x ] Серы  │  [ 1100x ] пороха│
│ 6. Граната F1           │  [ 10x ] │  [ 3000x ]  Серы  │  [ 300x ] пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '5':
            print("Стоимость рейда 'Зенитная турель: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 1. Сачель               │  [ 2x ]  │  [ 960x ]  Серы  │  [ 480x ] пороха │
│ 2. C4                   │  [ 1x ]  │  [ 2200x ] Серы  │  [ 1000x ] пороха│
│ 3. Ракета               │  [ 4x ]  │  [ 5600x ] Серы  │  [ 2600x ] пороха│
│ 4. Зажигательная ракета │  [ 1x ]  │  [ 1000x ] Серы  │  [ 100x ]  пороха│
│ 5. Зажиг. 12 калибр     │  [ 11x ] │  [ 220x ] Серы   │  [ 55x ]  пороха │
│ 6. Коктейль Молотова    │  [ 2x ]  │  [ 100x ] ТНК    │  [ 20x ] ткани   │
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice == '6':
            print("Стоимость рейда 'Танк: ")
            print("""
┌─────────────────────────┬──────────┬─────────────────────────────────────┐
│ №  ТИП ПРЕДМЕТА         │  КОЛ-ВО  │           ИТОГО РЕСУРСОВ            │
├─────────────────────────┼──────────┼──────────────────┬──────────────────┤
│ 2. C4                   │  [ 3x ]  │  [ 6600x ] Серы  │  [ 3000x ] пороха│
│ 4. Скоростная ракета    │  [ 7x ]  │  [ 1400x ]  Серы │  [ 700x ]  пороха│
└─────────────────────────┴──────────┴──────────────────┴──────────────────┘
""")
        elif choice.lower() == 'q':
            print('Выход из программы...')
            break
        else:
            print('Введите корректное чисо!')
            continue

if __name__ == '__main__':
    main()
